group = [
    {
        'фамилия': 'Иванов',
        'имя': 'Иван',
        'дата_рождения': '1998-05-20',
        'зачетка': [
            {
                'предмет': 'Математика',
                'дата_экзамена': '2023-01-15',
                'преподаватель': 'Петрова А.Н.'
            },
            {
                'предмет': 'Физика',
                'дата_экзамена': '2023-02-10',
                'преподаватель': 'Сидоров В.П.'
            }
        ]
    },
    {
        'фамилия': 'Петров',
        'имя': 'Петр',
        'дата_рождения': '1999-09-10',
        'зачетка': [
            {
                'предмет': 'История',
                'дата_экзамена': '2023-01-20',
                'преподаватель': 'Иванова О.В.'
            },
            {
                'предмет': 'Биология',
                'дата_экзамена': '2023-02-15',
                'преподаватель': 'Сидоров В.П.'
            },
            {
                'предмет': 'Химия',
                'дата_экзамена': '2023-03-05',
                'преподаватель': 'Сидоров В.П.'
            }
        ]
    }
]

def print_professors(group):
    professors = set()
    for student in group:
        for exam in student['зачетка']:
            professors.add(exam['преподаватель'])

    print("| Преподаватели |")
    print("| ------------- |")

    for professor in professors:
        print(f"| {professor} |")

def merge_arrays(array1, array2):
    merged_array = list(set(array1) & set(array2))
    return merged_array

while True:
    try:
        state = int(input("Выбери номер задачи(1 или 2) или отрицательное число для выхода:"))
    except ValueError:
        print("Это не число")
    if state == 1:
        print("Первое задание")
        arr1 = [1, 2, 3, 4, 5]
        arr2 = [4, 5, 6, 7, 8]
        result = merge_arrays(arr1, arr2)
        print(result)
    elif state == 2:
        print("Второе задание")
        print_professors(group)
    elif state < 0:
        break
    else:
        print("Число находится вне диапазона")
